+title: Working with OpenSpec with multiple Claude profiles
#+author: HaQadosch
#+date: [2026-02-15 Sun]
#+startup: indent
#+property: header-args :results output
** opsx:continue -> design
To check the current status (or *change* in opsx parlance) of the
project as a whole, with all the current tasks:
#+name: openspec list
#+begin_src bash
  openspec list
#+end_src

#+RESULTS: openspec list
: Changes:
:   scaffold-and-pipes     No tasks      1h ago

I can see there is a task in "progress".
Let's focus on that one:
#+name: openspec status 1
#+begin_src bash
  openspec status --change scaffold-and-pipes
#+end_src

#+RESULTS: openspec status 1
: Change: scaffold-and-pipes
: Schema: book-app-workflow
: Progress: 1/4 artifacts complete
:
: [x] proposal
: [ ] design
: [ ] specs
: [-] tasks (blocked by: design, specs)

I could use ~openspec show scaffold-and-pipes~ to see the content as well.
At this stage, this would be the [[file:openspec/changes/scaffold-and-pipes/proposal.md][proposal]].
Based on the progress track, next step is *design*.

#+begin_src bash
  /opsx:continue
#+end_src

It created the [[file:openspec/changes/scaffold-and-pipes/design.md][design]] doc.

It wanted to pin the node version to v22 but the latest LTS for node
is [[https://nodejs.org/en/blog/release/v24.13.1][v24.13]], so forced the change.

#+begin_src bash
  Created: design.md
  Progress: 2/4 — design done, tasks now only blocked by specs.
  [x] proposal
  [x] design
  [ ] specs     ← next
  [-] tasks     (blocked by: specs)
#+end_src
